<?php
// Heading
$_['heading_title']       = 'Блог';

// Text
$_['date_format_short']     = 'd.m.Y';
$_['text_blogs']          = 'Все записи';
$_['text_success']        = 'Вы успешно добавили свой комментарий!';
$_['text_approval']       = 'Вы успешно добавили свой комментарий, и он ожидает одобрения!';
$_['text_no_blogs']       = 'В этом магазине нет блогов!';
$_['text_read_more']      = 'читать далее';
$_['text_date_added']     = 'Дата добавления';
$_['text_login_required'] = 'Вы должны <a href="%s"> войти </a>, чтобы добавить комментарий. Если у вас нет учетной записи, вы можете <a href="%s"> зарегистрировать </a> для нее. Регистрация бесплатная!';
$_['text_your_comments']  = 'Ваши комментарии';
$_['text_leave_comment']  = 'Оставьте комментарий';
$_['text_error']       	  = 'Запись не найдена!';

// Entry
$_['entry_author']        = 'Автор';
$_['entry_email']         = 'E-Mail адресс';
$_['entry_comment']       = 'Комментарий';

// Column
$_['column_title']        = 'Название записи';

// Button
$_['button_comment_add']  = 'Добавить комментарий';
$_['button_list_blogs']   = 'Список всех записей';
$_['button_view']         = 'Посмотреть запись';

// Email
$_['email_subject']       = 'Комментарий записи: %s';
$_['email_content']       = 'Был сделан комментарий относительно записи под названием "%s".';

// Error
$_['error_author']        = 'Имя автора должно быть от 1 до 32 символов!';
$_['error_email']         = 'E-Mail Адрес не является действительным!';
$_['error_comment']       = 'Комментарий должен содержать от 10 до 3000 символов!';

