<?php
// Heading
$_['heading_title'] = '<img src="view/universal_import/img/icon.png" alt="" style="vertical-align:bottom;padding-right:4px"/><b>Универсальный</b> <b style="color:#156584;">Импорт/Экспорт Pro</b>';

// Text 
$_['text_module'] = 'Модули';
$_['text_browse'] = 'Просмотреть';
$_['text_continue'] = 'Следующий шаг';
$_['text_add_sub'] = 'Добавить';
$_['text_add_cat'] = 'Добавить категорию';
$_['text_add_subcat'] = 'Добавить подкатегорию';
$_['text_add_column'] = 'Добавить столбец';
$_['text_remove_column'] = 'Удалить столбец';
$_['not_found'] = 'Не найдено';
$_['new'] = 'новый';

$_['text_success'] = 'Успех: вы изменили настройки!';
$_['text_store_select'] = 'Магазин:';
$_['text_import'] = 'импортировать';
$_['text_source_upload'] = 'Выбор источника';
$_['text_source_ftp'] = 'FTP';
$_['text_source_url'] = 'URL';
$_['text_source_path'] = 'Локальный путь';
$_['text_type_product'] = 'Товар';
$_['text_type_product_update'] = 'Быстрое обновление товара';
$_['text_type_order'] = 'Заказ';
$_['text_type_order_status_update'] = 'Обновление статуса заказа';
$_['text_type_category'] = 'Категория';
$_['text_type_information'] = 'Информация';
$_['text_type_manufacturer'] = 'Производитель';
$_['text_type_customer'] = 'Клиент';
$_['text_subtype_order_info'] = 'Информация о заказе';
$_['text_subtype_order_item'] = 'Номенклатура заказа';
$_['text_type_attribute'] = 'Атрибут';
$_['text_type_filter'] = 'Фильтр';
$_['text_product'] = 'Товары';
$_['text_category'] = 'Категории';
$_['text_information'] = 'Информация';
$_['text_manufacturer'] = 'Производители';
$_['text_customer'] = 'Клиенты';
$_['text_order'] = 'Заказы';
$_['text_order_status'] = 'Статусы заказа';
$_['text_ignore'] = '';
$_['text_column'] = 'столбец';
$_['text_next_step'] = 'Проверьте и продолжите';
$_['text_start_process'] = 'Начать обработку импорта';
$_['text_pausing_process'] = 'Приостановка, пожалуйста, подождите, пока последняя загрузка не прекратит работу...';
$_['text_resume_process'] = 'Возобновить процесс';
$_['text_start_simu_process'] = 'Начать полное моделирование';
$_['text_pause_process'] = 'Выполняется импорт - нажмите, чтобы приостановить';
$_['text_pause_simu_process'] = 'Идет моделирование - нажмите, чтобы приостановить';
$_['text_previous_step'] = 'Предыдущий шаг';
$_['text_data_preview'] = 'Предварительный просмотр данных';
$_['text_row'] = 'Строка';
$_['text_status'] = 'Статус';
$_['text_message'] = 'Сообщение';

$_['text_action_update'] = 'Обновить - заменить';
$_['text_action_soft_update'] = 'Обновление - сохранить';
$_['text_action_insert'] = 'Вставить';
$_['text_action_skip'] = 'Пропуск';
$_['text_action_option'] = 'Добавить опцию';
$_['text_action_delete'] = 'Удалить';
$_['text_action_overwrite'] = 'Перезаписать';
$_['text_action_rename'] = 'Переименовать';
$_['text_img_action_keep'] = 'Сохранить фактическое изображение';
$_['text_img_action_rename'] = 'Переименовать новое изображение';
$_['text_img_action_overwrite'] = 'Перезаписать новым изображением';

// Tabs
$_['text_tab_0'] = 'Импортировать';

$_['text_import_step1'] = '<b>Шаг 1</b> - Выбор файла';
$_['text_import_step2'] = '<b>Шаг 2</b> - Импорт настроек';
$_['text_import_step3'] = '<b>Шаг 3</b> - Отображение столбцов';
$_['text_import_step4'] = '<b>Шаг 4</b> - Проверка данных';
$_['text_import_step5'] = '<b>Шаг 5</b> - Начать процесс';

// Profile manager
$_['text_profile_dir_not_writable'] = 'Папка профиля недоступна для записи, убедитесь, что у вас есть права на запись в папку (и подпапки):';
$_['text_profile_name'] = 'Имя профиля';
$_['text_new_profile'] = '- Сохранить как новый профиль -';
$_['text_save_profile'] = 'Сохранить профиль';
$_['text_delete_profile'] = 'Удалить профиль';
$_['text_really_delete'] = 'Вы уверены, что хотите удалить этот профиль?';
$_['text_save_profile_i'] = 'Сохраните текущие настройки, чтобы использовать их для дальнейшего импорта.<br/>Вы можете выбрать существующий профиль, чтобы перезаписать его или создать новый.';
$_['text_profile_saved'] = 'Ваш профиль был правильно сохранен';

// Step 1
$_['entry_name'] = 'Название';
$_['entry_demo_file'] = 'Загрузить демонстрационный файл';
$_['entry_demo_file_i'] = 'Используйте предварительно загруженные файлы, чтобы проверить поведение модуля. Если вы хотите загрузить свой собственный файл, оставьте это поле пустым и загрузите файл в предыдущем поле.';
$_['entry_type'] = 'Тип импорта';
$_['entry_subtype'] = 'Подтип импорта';
$_['entry_type_i'] = 'Какие данные вы собираетесь импортировать?';
$_['entry_profile'] = 'Профиль настроек';
$_['text_select_profile'] = 'Выберите профиль настройки';
$_['entry_profile_i'] = 'Профиль содержит все настройки, которые вы можете установить в шагах 2 и 3. Вы можете сохранить новый профиль в шаге 4';
$_['entry_file'] = 'Выберите источник файла';
$_['entry_file_i'] = 'Выберите ваш файл здесь.<br/>Неограниченный размер поддерживается.<br/>Совместимые форматы : CSV, XML, XLS, XLSX, ODS';
$_['source_ftp'] = 'FTP-соединение';
$_['source_ftp_i'] = 'Подключитесь к FTP, чтобы получить файл, не забудьте начальный ftp: //';
$_['source_ftp_path'] = 'Путь к файлу FTP';
$_['source_url'] = 'Ссылка на файл';
$_['source_url_i'] = 'Получить файл с внешнего URL-адреса, если файл защищен паролем, установите URL-адрес следующим образом http://user:password@website.tld/...';
$_['source_path'] = 'Путь к локальному файлу';
$_['source_path_i'] = 'Это относится к файлу, который находится на вашем сервере';
$_['text_extension_auto'] = 'Автоопределение';
$_['text_dropzone'] = 'Перетащите файл сюда или нажмите, чтобы загрузить';
$_['text_file_loaded'] = 'Файл загружен:';
$_['text_file_error'] = 'Ошибка:';

// Step 2
$_['text_common_settings'] = 'Общие настройки';
$_['entry_xml_node'] = 'Узел элемента XML';
$_['entry_xml_node_i'] = 'Например, задайте узел xml для каждого элемента в файле <product> или же <item> (установить значение без скобок). Система попытается автоматически определить его, просто измените его, если неверное значение';
$_['entry_csv_separator'] = 'Разделитель полей CSV';
$_['entry_multiple_separator'] = 'Разделитель нескольких значений';
$_['entry_multiple_separator_i'] = 'Если поле содержит несколько значений, определите символ, используемый для разделения этих';
$_['entry_xls_sheet'] = 'Рабочий лист';
$_['entry_xls_sheet_i'] = 'Если ваш файл содержит различные листы, вы можете выбрать тот, с которым будете работать';
$_['entry_csv_header'] = 'Первая строка заголовка';
$_['entry_item_identifier'] = 'Существующий идентификатор элемента';
$_['entry_item_identifier_i'] = 'Определите, существует ли элемент, который вы собираетесь вставить, если он соответствует этому полю';
$_['entry_item_exists'] = 'Существующий пункт действия';
$_['entry_item_exists_i'] = 'Режим замены: все значения будут обновлены, пустое сопоставление столбцов означает, что любое фактическое значение будет удалено (это использует метод opencart по умолчанию и включает любые изменения, примененные к нему) - Режим сохранения: обновятся только поля, установленные в сопоставлении столбцов, пустое поле означает отсутствие изменения фактического значения (не метод opencart, пользовательские значения здесь не могут быть применены)';
$_['entry_item_not_exists'] = 'Новый пункт действий';
$_['text_image_settings'] = 'Настройки изображения';
$_['entry_image_download'] = 'Загрузить изображения';
$_['entry_image_download_i'] = 'Если изображение является внешним URL, автоматически загрузите его на свой сервер, чтобы связать существующие изображения, используйте путь относительно /image/catalog/';
$_['entry_image_exists'] = 'Изображение существует действие';
$_['text_delete_settings'] = 'Удалить или отключить элементы';
$_['entry_delete'] = 'Режим';
$_['entry_delete_action'] = 'Действие';
$_['entry_delete_batch'] = 'Импорт метки';
$_['entry_no_delete_skipped'] = 'Пропущенные';
$_['text_no_delete_skipped_off'] = 'Удалить также пропущенные элементы';
$_['text_no_delete_skipped_on'] = 'Не удалять пропущенные элементы';
$_['text_delete_nothing'] = 'Ничего не удалять';
$_['text_delete_all'] = 'Для всех элементов перед импортом';
$_['text_delete_batch'] = 'Для всех элементов определенной метки импорта';
$_['text_delete_missing'] = 'Только для не обновленных элементов';
$_['text_delete_missing_brand'] = 'Для не обновленных элементов, но только в обновленных брендах';
$_['text_delete_zero'] = 'Обнулите количество';
$_['batch_delete_everything'] = 'Любая метка импорта';
$_['batch_delete_empty'] = 'Нет метки импорта';
$_['batch_delete_defined'] = 'Существующая метка импорта';
$_['batch_group_general'] = 'Удалить элементы с помощью:';
$_['batch_group_specific'] = 'Или только с определенной меткой импорта:';
$_['warning_delete'] = 'Предупреждение: элементы будут удалены из базы данных, убедитесь, что это то, что вы хотите';
$_['text_deleted'] = 'Удаленный элемент: ';
$_['text_nothing_deleted'] = 'нечего удалять';
$_['text_disabled_all'] = 'Отключить все элементы';
$_['text_delete_delete'] = 'Удалить (удалить из базы данных)';
$_['text_delete_disable'] = 'Отключить (установить статус отключен)';
$_['entry_image_exists_i'] = 'Что делать, если изображение с таким именем уже существует?';
$_['entry_image_location'] = 'Расположение изображения';
$_['entry_image_location_i'] = 'В случае загрузки изображений поместите их в определенный каталог (например: products/). Этот параметр не используется в случае существующих изображений';
$_['entry_image_keep_path'] = 'Копировать путь URL';
$_['entry_image_keep_path_i'] = 'Сохраняйте ту же структуру, что и в текущем местоположении. Например, если url is myshop.com/dir/subdir/image.jpg, изображение будет сохранено в dir/subdir/image.jpg.';
$_['text_category_settings'] = 'Настройки категории';
$_['entry_category_create'] = 'Создать, если не существует';
$_['entry_include_subcat'] = 'Включить товар в родительской категории';
$_['entry_include_subcat_i'] = 'Если у вас есть определенная категория, например «Настольный компьютер»> «ПК»> «Клавиатуры», то по умолчанию товар перейдет в раздел «Клавиатуры», если вы установите родительский режим, он перейдет в раздел «Клавиатуры и ПК», а если вы установите все, он перейдет во все эти 3 категории.';
$_['entry_filter_to_category'] = 'Автоматическое создание фильтров';
$_['entry_filter_to_category_i'] = 'Автоматически добавлять фильтры импортируемых товаров в соответствующие категории';
$_['text_include_subcat_none'] = 'Поместите товар только в определенную категорию';
$_['text_include_subcat_parent'] = 'Поместите товар также в родительскую категорию';
$_['text_include_subcat_all'] = 'Поместите товар во все родительские категории';
$_['text_manufacturer_settings'] = 'Настройки производителя';
$_['entry_manufacturer_create'] = 'Создать, если не существует';
$_['text_product_settings'] = 'Настройки товара';
$_['entry_preserve_attribute'] = 'Сохранить атрибуты';
$_['entry_preserve_attribute_i'] = 'Если включенные атрибуты не будут сброшены при импорте, это работает только в режиме сохранения обновлений!';
$_['entry_filter_generate'] = 'Создать фильтры из';
$_['entry_filter_generate_i'] = 'Отметьте эти параметры, чтобы автоматически создавать фильтры товара на основе следующих полей';
$_['entry_limit'] = 'Ограничить импорт';
$_['entry_limit_i'] = 'Ограничить количество элементов для импорта Начало: начать с этой строки элемента - Конец: остановить на этой строке элемента';
$_['entry_limit_start'] = 'Начать строку';
$_['entry_limit_max'] = 'Макс. элементы';
$_['text_extra_fields'] = 'Дополнительные поля';
$_['entry_extra_fields'] = 'Дополнительные поля';
$_['entry_extra_fields_i'] = 'Разделенные запятыми, добавьте столько дополнительных полей, сколько вам нужно для дальнейшего использования с дополнительными функциями, например, вы можете выполнить некоторую операцию на существующем поле вашего канала, а затем сохранить результат в дополнительное поле';
$_['text_limit_settings'] = 'Ограничить набор данных';
$_['entry_limit_batch_status'] = 'Ограничить импорт метки';
$_['entry_limit_field_status'] = 'Ограничение поля DB';
$_['entry_limit_field'] = 'Ограничить поле DB, если';
$_['import_all_attribute'] = 'Импортировать все атрибуты';
$_['import_product_attribute'] = 'Импорт атрибутов товара';
$_['text_import_product_attributes'] = 'Импортируйте атрибуты непосредственно в ваши товары, вам нужно выбрать идентификатор товара, в который будет добавлен атрибут.';
$_['entry_delete_attributes'] = 'Очистить атрибуты';
$_['entry_delete_attributes_i'] = 'Включите эту опцию, если вы хотите, чтобы текущие атрибуты товара были очищены перед импортом';
$_['entry_attribute_id'] = 'Идентификатор атрибута';
$_['entry_attribute_name'] = 'Название атрибута';
$_['import_all_filter'] = 'Импортировать все фильтры';
$_['import_product_filter'] = 'Импорт фильтров товаров';
$_['text_import_product_filters'] = 'Импортируйте фильтры непосредственно в ваши товары, вам нужно выбрать идентификатор товара, в который будет добавлен фильтр.';
$_['entry_delete_filter'] = 'Очистить атрибуты (Очистить фильтры)';
$_['entry_delete_filter_i'] = 'Включите эту опцию, если вы хотите, чтобы текущие фильтры товара были очищены перед импортом';
$_['entry_filter_id'] = 'Идентификатор фильтра';
$_['entry_filter_name'] = 'Название фильтра';
$_['entry_sort_order'] = 'Порядок сортировки';

// Step 3
$_['tab_order'] = 'Порядок (заказ)';
$_['tab_info'] = 'Дополнительная информация';
$_['tab_extra'] = 'Пользовательские поля';
$_['entry_extra'] = 'Пользовательское поле';
$_['entry_extra_ml'] = 'Описание пользовательского поля';
$_['entry_disable_config'] = 'Отключить конфигурацию';
$_['placeholder_disable_config'] = 'config_module_option, config_extra_option';
$_['placeholder_extra_col'] = 'Имя поля';
$_['tab_disable_cfg'] = 'Отключить параметры конфигурации';
$_['info_disable_cfg'] = 'Как и предыдущий параметр, это может быть полезно в случае, если какой-либо сторонний модуль хочет вставить данные при создании/редактировании элемента.<br/>Если у вас нет соответствующих данных в файле импорта, и импорт не выполняется из-за отсутствия дополнительных данных, вы можете использовать опцию дополнительного поля с пустым значением, или в некоторых случаях еще проще просто отключить соответствующую опцию конфигурации.<br/><br/>Например, если в вашей модели есть что-то подобное:<br/><code>if ($this->config->get(\'superfilter_status\')) {<br/>&nbsp;&nbsp;&nbsp;// вставить данные модуля...<br/>&nbsp;}</code><br/><br/>Затем, если эта часть кода делает импорт неудачным, вы можете просто поместить в поле ниже "superfilter_status", он временно установит для этого параметра значение false, чтобы вы могли избежать связанных ошибок во время импорта.<br/>Используйте запятую в качестве разделителя, если вам нужно ввести различные значения.';
$_['info_extra_field'] = 'Здесь вы можете определить свои собственные поля, это полезно, если у вас есть модуль, который добавляет данные в ваши таблицы.<br/>Если настраиваемое поле многоязычно, то оно хранится в описании части, поэтому вы должны использовать описание настраиваемого поля, может быть полезно для seo модуля, например, которые добавляют SEO H1 и другие данные, узнать, какое имя используется этим модулем и поставить "meta_h1" или "seo_h1" в имя поля, и в правом селекторе просто выберите, в какой столбец он будет принимать данные.<br/><br/>Если во время импорта у вас есть некоторые неопределенные ошибки индекса, это много раз, потому что у вас есть пользовательские поля, добавленные модулями, поэтому вы должны использовать этот раздел, чтобы добавить их для процесса импорта, ошибка скажет вам, какое точное имя требуется.<br/><br/>Имя настраиваемого поля должно быть задано так, как оно отображается в базе данных.';
$_['text_remove_extra_col'] = 'Удалить пользовательское поле';
$_['text_add_extra_field'] = 'Добавить новое пользовательское поле';
$_['text_add_extra_field_ml'] = 'Добавьте новое описание пользовательского поля';
$_['tab_functions'] = 'Дополнительные функции';
$_['text_add_function'] = 'Добавить функцию';
$_['text_function_type'] = 'Тип';
$_['text_function_action'] = 'Действие';
$_['text_function_target'] = 'Сохранить результат в';
$_['text_function_same_field'] = 'Текущее поле';
$_['text_function_extra_field'] = 'Дополнительное поле';
$_['text_remove_function'] = 'Удалить функцию';
$_['info_identifier_title'] = 'Идентификатор элемента';
$_['info_identifier'] = 'Поле ниже является обязательным, поскольку оно используется для определения элемента, который необходимо обновить.';
$_['tab_quick_update'] = 'Быстрое обновление';
$_['entry_option_identifier'] = 'Идентификатор опции';
$_['entry_option_identifier_i'] = 'Оставьте пустым, чтобы обновить основной товар';
$_['entry_option_identifier_value'] = 'Значение опции';
$_['text_quick_update_identifier'] = 'Здесь вы можете быстро обновить элементы с помощью наиболее распространенных обновленных значений.<br/>Поле ниже является обязательным, поскольку оно используется для определения элемента, который необходимо обновить.';
$_['text_quick_update_option_identifier'] = '<h4>Обновить опции товара</h4>Если вы хотите обновить только количество опций товара, вы должны указать опцию товара в следующих полях, выберите опцию и то, что соответствует этой опции в вашем фиде импорта.<br/>Например, идентификатор опции как «Цвет» и в поле «Значение опции» выберите поле, в котором у вас есть цвет внутри.';
$_['entry_product_id'] = 'Идентификатор товара';
$_['entry_title'] = 'Заголовок';
$_['entry_product_name'] = 'Наименование товара';
$_['entry_payment_method_name'] = 'Название способа оплаты';
$_['entry_payment_method_code'] = 'Код способа оплаты';
$_['help_field_payment_method_name'] = 'Название способа оплаты, как оно будет отображаться в заказе, вы можете установить только этот, если код не задан, он не будет предварительно выбран при редактировании заказа';
$_['help_field_payment_method_code'] = 'Вот ожидаемый код в формате opencart, например bank_transfer, cod, paypal, free_checkout';
$_['entry_shipping_method_name'] = 'Название способа доставки';
$_['entry_shipping_method_code'] = 'Код способа доставки';
$_['help_field_shipping_method_name'] = 'Название способа доставки, как оно будет отображаться в заказе, вы можете установить только этот, если код не установлен, он просто не будет предварительно выбран при редактировании заказа';
$_['help_field_shipping_method_code'] = 'Здесь ожидается код в формате opencart, например, free, flat, fedex, weight';
$_['entry_total_code'] = 'Общий код';
$_['help_field_code'] = 'Общий код в формате opencart, например, total, sub_total, shipping, tax';
$_['entry_model'] = 'Модель';
$_['entry_price'] = 'Цена';
$_['entry_tax'] = 'Налог';
$_['entry_order_id'] = 'Идентификатор заказа';
$_['entry_order_id_user'] = 'Случайный Идентификатор заказа';
$_['entry_create_order_total'] = 'Автоматическое создание всего элемента<br/>Auto create total item';
$_['entry_notify'] = 'Уведомлять';
$_['entry_tracking_no'] = 'Идентификационный номер';
$_['entry_tracking_url'] = 'URL отслеживание';
$_['entry_order_status_comment'] = 'Комментарий';
$_['entry_order_status'] = 'Статус заказа';
$_['help_field_order_status'] = 'Все заказы будут обновлены с указанным статусом заказа, может быть идентификатором или именем статуса заказа, вы также можете оставить пустым и принудительно установить статус заказа в поле По умолчанию.';
$_['entry_seo_h1'] = 'СЕО H1';
$_['entry_seo_h2'] = 'СЕО H2';
$_['entry_seo_h3'] = 'СЕО H3';
$_['entry_img_title'] = 'Заголовок изображения';
$_['entry_img_alt'] = 'Изображение alt';
$_['entry_separator'] = 'Разделитель';
$_['entry_subcat_separator'] = 'Разделитель подкатегорий';
$_['entry_subcat_separator_i'] = 'Например: cat1> subcat1; cat2> subcat2';
$_['entry_dimension_l'] = 'Длина';
$_['entry_dimension_w'] = 'Ширина';
$_['entry_dimension_h'] = 'Высота';
$_['entry_category_id'] = 'Идентификатор категории ';
$_['entry_information_id'] = 'Идентификатор информации';
$_['entry_manufacturer_id'] = 'Идентификатор производителя';
$_['entry_customer_id'] = 'Идентификатор клиента';
$_['entry_value_modifier'] = 'Режим (способ)';
$_['entry_value_modifier_i'] = 'Заменить: заменить фактическое значение новым - Добавить: добавить новое значение к фактическому - Вычесть: вычесть новое значение из фактического';
$_['entry_email'] = 'Email';
$_['import_default_value'] = 'По умолчанию';
$_['entry_default'] = 'По умолчанию';
$_['entry_default_i'] = 'Введите здесь значение по умолчанию для этого поля, если поле пустое или не сопоставлено ни с одним значением, будет использоваться значение по умолчанию';
$_['help_field_category'] = 'Если в этом поле определено несколько категорий, используйте разделитель нескольких значений, например: cat1> subcat1; cat2> subcat2';
$_['help_field_related_id'] = 'Используйте несколько разделителей для вставки нескольких значений, значение может быть идентификатором товара или идентификатором элемента, заданным на шаге 2';
$_['help_field_image'] = 'В случае нескольких значений выбирается первое';
$_['help_field_product_image'] = 'Чтобы импортировать различные изображения, вы можете использовать одно поле с несколькими разделителями или нажать «Добавить столбцы», чтобы взять изображения из различных полей.';
$_['help_field_product_option_xml__'] = 'Используйте этот формат: <option> <optionType>type</optionType> <optionNameEn>Name english</optionNameEn> <optionValueEn>Value english</optionValueEn> <optionPrice>Price</optionPrice> <optionRequired>Required</optionRequired> </option> - Параметры и значения параметров создаются автоматически, если их не существует.';
$_['help_field_product_option__'] = 'Может быть отформатирован различными способами - 1: <name>:<value> (тип автоматически устанавливается для выбора, если параметр не существует) - 2: <type>:<name>:<value> 3: <type>:<name>:<value>:<price> - 4: <type>:<name>:<value>:<price>:<qty> - 5: <type>:<name>:<value>:<price>:<qty>:<subtract> - 6: <type>:<name>:<value>:<price>:<qty>:<subtract>:<weight> - 7: <type>:<name>:<value>:<price>:<qty>:<subtract>:<weight>:<required> - Параметры и значения параметров создаются автоматически, если их не существует.';
$_['help_field_product_attribute__'] = 'Может быть отформатирован различными способами - 1: <attribute_group_name>:<attribute_name>:<value> - 2: <attribute_name>:<value> 3: <value> (заголовок используется как имя атрибута) - 4: <ul><li>Название группы: value</li></ul>Группа и атрибут создаются автоматически, если они не существуют. В случаях 2 и 3, если атрибут не существует, он присваивается группе `По умолчанию`';
$_['help_field_product_special'] = 'Должен быть отформатирован следующим образом: <price> - или <customer_group_id>:<price> - или <customer_group_id>:<priority>:<price> - или <customer_group_id>:<priority>:<price>:<date_end> - или <customer_group_id>:<priority>:<price>:<date_start>:<date_end> (если дата не указана, она будет установлена без ограничения по времени)';
$_['help_field_product_discount'] = 'Должен быть отформатирован следующим образом: <price> - или <price>:<date_end> - или <price>:<date_start>:<date_end> - или <qty>:<price>:<date_start>:<date_end> - или <customer_group_id>:<qty>:<price>:<date_start>:<date_end> - или <customer_group_id>:<qty>:<priority>:<price>:<date_start>:<date_end>';
$_['help_field_product_id'] = 'Используйте это, если Вы хотите вызвать Используйте это, если Вы хотите вызвать идентификатор товара';
$_['help_field_manufacturer_id'] = 'Используйте либо идентификатор производителя, либо название производителя';
$_['help_field_product_category'] = 'Используйте либо идентификатор категории, либо название категории. Вы можете добавить столько подкатегорий, сколько необходимо, они будут следовать порядку, указанному здесь.';
$_['help_field_product_filter'] = 'Отформатируйте фильтры следующим образом: filter_group:filter_name';
$_['help_field_stock_status_id'] = 'Работает с названием товара или идентификатором, если имя не существует, оно будет создано';
$_['help_field_status'] = $_['help_field_notify'] = $_['help_field_newsletter'] = $_['help_field_safe'] = $_['help_field_approved'] = 'Работает с этими значениями: 1/0, on/off, true/false, enabled/disabled, yes/no, active/inactive';
$_['help_field_order_status_comment'] = 'Вы можете использовать эти теги: {tracking_no} {tracking_url}';
$_['help_field_parent_id'] = 'Если более 2 уровней, это поле должно быть отформатировано с разделителем подкатегорий: Cat1 > Subcat1 > Subcat2';
$_['entry_salt'] = 'Соль(модификатор)';
$_['help_field_password'] = '';
$_['help_field_salt'] = 'Соль(модификатор) является дополнительной защитой для пароля, это поле должно быть установлено, если пароли, которые вы импортируете, уже зашифрованы, если не установлены, ваши пользователи не смогут войти';
$_['entry_pwd_hash'] = 'Шифрование';
$_['entry_pwd_hash_i'] = 'Если ваш пароль зашифрован, проверьте соответствующее значение здесь и заполните солт-поле, которое необходимо для входа клиента';
$_['text_pwd_clear'] = 'Очистить пароль';
$_['text_pwd_hash'] = 'Зашифрованный пароль';
$_['entry_invoice_no'] = 'Счет № (счет-фактуры нет)';
$_['entry_invoice_prefix'] = 'Префикс счет-фактуры';
$_['entry_user_agent'] = 'Агент пользователя';

// extra functions
$_['xfn_group_string'] = 'Текстовые операции';
$_['xfn_group_regex'] = 'Текст операций регулярных выражений ';
$_['xfn_group_number'] = 'Номер операции ';
$_['xfn_group_html'] = 'HTML';
$_['xfn_group_product'] = 'Товар';
$_['xfn_group_web'] = 'Веб';
$_['xfn_group_other'] = 'Специальные функции';
$_['xfn_manual_value'] = 'Ручное значение -&gt;';
$_['xfn_append'] = '<i class="fa fa-fw">&#xf038;</i> Добавить';
$_['xfn_append_i'] = 'Добавить что-то после поля';
$_['xfn_prepend'] = '<i class="fa fa-fw">&#xf036;</i> Предварительно';
$_['xfn_prepend_i'] = 'Предварительно что-то перед полем';
$_['xfn_uppercase'] = '<i class="fa fa-fw">&#xf031;</i> Верхний регистр';
$_['xfn_uppercase_i'] = 'Пример: ПРИМЕР ТЕКСТА';
$_['xfn_lowercase'] = '<i class="fa fa-fw">&#xf031;</i> Нижний регистр';
$_['xfn_lowercase_i'] = 'Пример: пример текста';
$_['xfn_ucfirst'] = '<i class="fa fa-fw">&#xf031;</i> Заглавные первую букву';
$_['xfn_ucfirst_i'] = 'Пример: Пример текста';
$_['xfn_ucwords'] = '<i class="fa fa-fw">&#xf031;</i> Заглавные в словах';
$_['xfn_ucwords_i'] = 'Пример: Пример Текста';
$_['xfn_substr'] = '<i class="fa fa-fw">&#xf0c4;</i> Усеченная строка (truncate string';
$_['xfn_substr_i'] = 'Получить x первых символов поля';
$_['xfn_urlify'] = '<i class="fa fa-fw">&#xf0c1;</i> Формат для URL';
$_['xfn_urlify_i'] = 'Отформатируйте строку для использования в сео ключевом слове, примените строчные буквы и замените пробелы тире (черточками), если применяется перевод, все акцентированные символы будут преобразованы в их эквивалент ascii';
$_['xfn_substr_set'] = 'Сокращение числа символов';
$_['xfn_substr_of'] = 'От';
$_['xfn_nl2br'] = '<i class="fa fa-fw">&#xf121;</i> Преобразовать разрывы строк в HTML';
$_['xfn_nl2br_i'] = 'Разрывы строк будут преобразованы в формат html с тегом br';
$_['xfn_strip_tags'] = '<i class="fa fa-fw">&#xf121;</i> Убрать теги HTML';
$_['xfn_strip_tags_i'] = 'Удалите любой тег HTML, чтобы получить чистый текст';
$_['xfn_html_encode'] = '<i class="fa fa-fw">&#xf121;</i> Кодировать HTML-объекты';
$_['xfn_html_encode_i'] = 'Преобразование специальных символов в HTML-объекты';
$_['xfn_html_decode'] = '<i class="fa fa-fw">&#xf121;</i> Декодировать HTML-сущности';
$_['xfn_html_decode_i'] = 'Преобразуйте все HTML-сущностей в их применимые символы, может быть полезно, если у вас есть некоторое содержимое html не правильно импортировано';
$_['xfn_date_convert'] = '<i class="fa fa-fw">&#xf073;</i> Конвертер даты';
$_['xfn_date_convert_i'] = 'Преобразуйте дату в формат SQL, выберите текущий формат поля даты, чтобы преобразовать его правильно';
$_['xfn_if_table'] = '<i class="fa fa-fw">&#xf059;</i> Условное значение';
$_['xfn_if_table_i'] = 'Установите окончательное значение в зависимости от вашего фактического значения, используйте оператор для сравнения со значением поля и выберите окончательное значение. Пример: ~ (колеса): автомобиль означает, что если в текущем поле есть слово «колеса», то в качестве выходного значения укажите «Автомобиль».';
$_['xfn_replace'] = '<i class="fa fa-fw">&#xf0d0;</i> Заменить текст';
$_['xfn_replace_set'] = 'Заменить';
$_['xfn_regex_replace'] = '<i class="fa fa-fw">&#xf0d0;</i> Заменить регулярное выражение';
$_['xfn_regex_replace_i'] = 'Замените часть строки с помощью регулярных выражений, например, если вы хотите изменить поле, например, бренд: Sony | type: для ноутбука вместо MyBrand использовать MyBrand, после поиска по регулярному выражению:: brand:(.+)| replace: brand:MyBrand|';
$_['xfn_regex'] = '<i class="fa fa-fw">&#xf0c4;</i> Извлечение из регулярных выражений';
$_['xfn_regex_i'] = 'Извлеките часть строки с помощью regex, используйте (), чтобы определить часть, которую вы хотите извлечь, например, если у вас есть поле, например brand: Sony / type: Laptop, и вы хотите извлечь Sony для вставки в бренды, примените следующее регулярное выражение: brand:(.+)|';
$_['xfn_regex_remove'] = '<i class="fa fa-fw">&#xf12d;</i> Удалить регулярное выражение';
$_['xfn_regex_remove_i'] = 'Удалите текст с помощью регулярных выражений, например, удалите любой специальный символ из строки: [^0-9a-zA-Z]';
$_['xfn_remove'] = '<i class="fa fa-fw">&#xf12d;</i> Удалить текст';
$_['xfn_remove_set'] = 'Удалить';
$_['xfn_remote_content_set'] = 'Получить содержимое из url поля';
$_['xfn_remote_content'] = '<i class="fa fa-fw">&#xf019;</i> Удаленное содержимое';
$_['xfn_remote_content_i'] = 'Получить содержимое страницы, содержащейся в url-адресе, может быть полезно, если в ленте указана только ссылка для получения описания или других данных.';
$_['xfn_add'] = '<i class="fa fa-fw">&#xf1ec;</i> Добавить';
$_['xfn_subtract'] = '<i class="fa fa-fw">&#xf1ec;</i> Вычесть';
$_['xfn_multiply'] = '<i class="fa fa-fw">&#xf1ec;</i> Помножить';
$_['xfn_divide'] = '<i class="fa fa-fw">&#xf1ec;</i> Разделить';
$_['xfn_round'] = '<i class="fa fa-fw">&#xf1ec;</i> Округлить(round)';
$_['placeholder_xfn_if_table'] = '~(search_value):final_value (один на строку)';
$_['placeholder_xfn_wholesale'] = 'max_price:множитель (один на строку)';
$_['xfn_wholesale'] = '<i class="fa fa-fw">&#xf1ec;</i> Множитель оптовой цены';
$_['xfn_wholesale_i'] = 'Умножьте текущую цену на другой коэффициент в зависимости от значения, например, если вы хотите, чтобы все цены ниже 10 были умножены на 2, просто напишите 10: 2, а затем, если вы хотите, чтобы все цены ниже 50 были умножены на 1,5, добавьте новую строку и напишите 50: 1.5';
$_['xfn_skip_set'] = 'Пропустить текущий элемент, если';
$_['xfn_skip_db_set'] = 'Пропустить текущий элемент, если';
$_['xfn_option'] = '<i class="fa fa-fw">&#xf0c9;</i> Опция товара';
$_['xfn_option_set'] = 'Текущая строка является опцией товара, если';
$_['xfn_skip'] = '<i class="fa fa-fw">&#xf054;</i> Пропустить значение импорта';
$_['xfn_skip_i'] = 'Пропустить текущий элемент импорта, если значение в файле импорта соответствует другому значению (значение файла импорта или значение добавленное вручную)';
$_['xfn_skip_db_i'] = 'Пропустить текущий элемент импорта, если значение элемента вашего магазина соответствует другому значению (значение файла импорта или значение добавленное вручную)';
$_['xfn_skip_db'] = '<i class="fa fa-fw">&#xf054;</i> Пропустить существующее значение';
$_['xfn_delete_item'] = '<i class="fa fa-fw">&#xf014;</i> Удалить или отключить элемент';
$_['xfn_multiple_separator'] = '<i class="fa fa-fw">&#xf03a;</i> Разделитель нескольких значений';
$_['xfn_multiple_separator_set'] = 'Установить разделитель нескольких значений как';
$_['xfn_for_column'] = 'Для столбцов';
$_['xfn_source_field'] = 'Исходное поле';
$_['xfn_target_field'] = 'Целевое поле';
$_['text_if_table_table'] = '<div style="cursor:text">Conditional table<br/><span style="color:#888"><b>Is equal</b><br/>=(test):final_value<br/>!=(test):final_value<br/><b>Contains</b><br/>~(test):final_value<br/>!~(test):final_value<br/><b>Is greater</b><br/>&gt;(test):final_value<br/>&lt;(test):final_value<br/></span></div>';
$_['text_wholesale_table'] = 'Таблица множителей';
$_['text_round'] = 'Округлить(round)';
$_['xfn_if'] = 'Если (If)';
$_['xfn_of'] = 'Из (Of)';
$_['xfn_to'] = 'К (To)';
$_['xfn_by'] = 'От (By)';
$_['xfn_in'] = 'В (In)';
$_['xfn_for'] = 'Для (For)';
$_['xfn_from'] = 'С (From)';
$_['xfn_after'] = 'После';
$_['xfn_before'] = 'До';
$_['xfn_is_equal'] = 'равно';
$_['xfn_is_not_equal'] = 'не равно';
$_['xfn_contain'] = 'содержит';
$_['xfn_not_contain'] = 'не содержит';
$_['xfn_is_greater'] = 'больше, чем';
$_['xfn_is_lower'] = 'меньше, чем';
$_['xfn_mode'] = 'Режим';
$_['xfn_precision'] = 'С точностью до';
$_['xfn_precision_'] = 'Нет раунда (no round)';
$_['xfn_precision_0'] = 'Целое число (1)';
$_['xfn_precision_1'] = '1 десятичный (1.2)';
$_['xfn_precision_2'] = '2 десятичные (1.23)';
$_['xfn_precision_3'] = '3 десятичные (1.234)';
$_['xfn_precision_4'] = '4 десятичные (1.2345)';
$_['text_delete_if'] = 'Удалить, если';
$_['text_value_is'] = 'Равно';
$_['text_urlify_basic'] = 'Базовый';
$_['text_urlify_default'] = 'Базовое форматирование';
$_['text_urlify_ascii'] = 'Транслит в ascii';
$_['text_translit'] = 'Транслит';
$_['info_extra_functions'] = 'С помощью дополнительных функций вы можете выполнять определенные операции с исходными данными, например, умножать число, вводить строку в верхний регистр и т. д.<br/><br/>Использование:<ol><li>Выберите нужную функцию в поле ниже</li><li>Нажмите на "Добавьте функцию"</li><li>Выберите поле источник, к которому следует применить функцию</li><li>Определите другие параметры, если таковые имеются</li><li>Выберите целевое поле, в котором вы хотите сохранить результат</li></ol>Вы можете применить несколько операций в одном поле, они будут применяться в том порядке, в котором они определены.<br/><br/>Если вы хотите сохранить некоторые данные в дополнительных полях, не забудьте добавить дополнительные поля в шаге 2.';
$_['text_date_format_eu'] = 'EU: DD/MM/YYYY';
$_['text_date_format_us'] = 'US: MM/DD/YYYY';
$_['text_convert_from'] = 'Конвертировать из';

// option bindings
$_['text_optbinding_name'] = 'Тип';
$_['text_optbinding_bind_to'] = 'Поле';
$_['text_get_optbinding'] = 'Получить дополнительные поля опций';

// category bindings
$_['tab_cat_binding'] = 'Привязки категории';
$_['entry_cat_binding_mode'] = 'Режим привязки';
$_['text_cat_binding_default'] = 'Смешанный - вставьте связанные категории, а не связанные со значением поля';
$_['text_cat_binding_exclusive'] = 'Эксклюзивно - вставлять только связанные категории, значение поля категории игнорируется';
$_['text_cat_binding_exclusive_skip'] = 'Эксклюзивно, пропустить пустые - вставить только связанные категории, значение поля категории игнорируется, пропустить элемент, если категории нет';
$_['text_cat_binding_skip'] = 'Пропустить несвязанные - вставьте только связанные категории, элементы с хотя бы одной несвязанной категорией будут пропущены';
$_['text_catbinding_name'] = 'Категория источника';
$_['text_catbinding_bind_to'] = 'Привязка к';
$_['text_get_bindings'] = 'Обновить список категорий';
$_['text_no_bindings'] = 'Не определена привязка категории, нажмите кнопку обновить, чтобы просмотреть все категории в файле фактического импорта.';
$_['text_no_binding'] = '- никакой -';
$_['info_cat_binding_title'] = 'Привязки категории';
$_['info_cat_binding'] = 'Если в ваших исходных данных есть названия категорий, которые не соответствуют вашим, вы можете использовать эту функцию, чтобы определить привязку для каждой категории в вашем исходном файле.<br/><br/>Использование:<ul><li>Если это еще не сделано, выберите поле вашей категории на вкладке "Ссылки"</li><li>Нажмите «Обновить список категорий», чтобы получить список всех категорий, существующих в вашем исходном файле.</li><li>Выберите, в какую категорию opencart вы хотите перенести каждую категорию источника</li></ul>Не обязательно устанавливать все категории, просто удалите те, которые не требуют привязки, для них будет применяться поведение по умолчанию (проверьте, существует ли категория, и попробуйте создать ее, если нет).<br/>Если вы хотите, чтобы категории вставлялись только на основе связанных значений, выберите режим эксклюзивной привязки.';
$_['info_col_binding_skip'] = 'Элемент пропущен, поскольку для некоторых категорий не найдено привязки категорий';
$_['info_col_binding_skip_empty'] = 'Элемент пропущен, потому что нет категории, привязанной к этому товару';

// Step 4
$_['text_simu_summary'] = 'Моделирование аннотация (10 строк):';
$_['text_full_simu_summary'] = 'Полный отчет моделирования:';
$_['text_item_to_update'] = 'Элемент для обновления';
$_['entry_row_status'] = 'Действие строки';
$_['text_simu_inserted'] = 'Вставить';
$_['text_simu_updated'] = 'Обновить';
$_['text_simu_disabled'] = 'Отключить';
$_['text_simu_qtyzero'] = 'Обнулите количество';
$_['text_simu_deleted'] = 'Удалить';
$_['text_simu_skipped'] = 'Пропустить';
$_['text_simu_error'] = 'Ошибка';

// Step 5
$_['text_import_label'] = 'Импорт метки';
$_['text_import_label_i'] = 'Дайте имя этому сеансу импорта, затем в списке товаров вы сможете отфильтровать товары, которые были импортированы на этот раз. Оставьте пустым, чтобы не изменять метку импорта, если она существует.';
$_['text_process_summary'] = 'Краткое описание процесса';
$_['text_rows_csv'] = 'Всего строк в файле';
$_['text_rows_process'] = 'Всего строк для обработки';
$_['text_rows_insert'] = 'Всего строк для вставки';
$_['text_rows_update'] = 'Всего строк для обновления';
$_['text_process_done'] = 'Статус процесса';
$_['text_rows_processed'] = 'Обработанный';
$_['text_rows_inserted'] = 'Вставляемый';
$_['text_rows_updated'] = 'Обновленный';
$_['text_rows_disabled'] = 'Отключенный';
$_['text_rows_qtyzero'] = 'Обнулите количество';
$_['text_rows_deleted'] = 'Удаленный';
$_['text_rows_skipped'] = 'Пропущенные';
$_['text_rows_error'] = 'Ошибка';
$_['text_empty_line_skip'] = 'Пустая строка';


$_['entry_color_scheme'] = 'Цветовая схема:<span class="help">Быстрый доступ к некоторым цветовым схемам, редактируйте их во вкладке дизайна</span>';
$_['entry_logo'] = 'Лого';
$_['entry_feed_title'] = 'Название:';
$_['entry_cache_delay'] = 'Задержка кэша:<span class="help">Сколько времени показывать сгенерированный файл до повторной генерации?</span>';
$_['entry_language'] = 'Язык:<span class="help"></span>';
$_['entry_feed_url'] = 'URL фида данных:<span class="help">Передать этот URL службе назначения</span>';
$_['entry_additional_image'] = 'Дополнительные изображения';

$_['text_no_change'] = '- Без изменений -';
$_['text_on'] = 'On';
$_['text_off'] = 'Off';

// File format
$_['text_format_csv'] = 'CSV';
$_['text_format_xml'] = 'XML';
$_['text_format_xls'] = 'XLS';
$_['text_format_xlsx'] = 'XLSX';
$_['text_format_ods'] = 'ODS';
$_['text_format_pdf'] = 'PDF';
$_['text_format_html'] = 'HTML';

// Export
$_['text_tab_1'] = 'Экспорт';
$_['entry_export_type'] = 'Тип экспорта';
$_['entry_export_type_i'] = 'Какие данные вы хотите экспортировать ?';
$_['entry_export_format'] = 'Формат экспорта';
$_['entry_export_format_i'] = 'Выберите формат файла на выходе';
$_['text_start_export'] = 'Создать файл экспорта';
$_['export_all'] = '- Все -';
$_['export_all_filters'] = 'Все фильтры';
$_['export_product_filters'] = 'Фильтры товаров';
$_['export_all_attributes'] = 'Все атрибуты';
$_['export_product_attributes'] = 'Атрибуты товаров';
$_['mode'] = 'Mode';

// Export filters
$_['export_filters'] = 'Фильтры';
$_['total_export_items'] = 'Всего товаров для экспорта:';
$_['filter_language'] = 'Язык';
$_['filter_manufacturer'] = 'Производитель';
$_['filter_manufacturer_i'] = 'Вы можете выбрать несколько производителей, начните вводить текст, чтобы быстро найти производителя';
$_['filter_category'] = 'Категория';
$_['filter_category_i'] = 'Вы можете выбрать несколько категорий, начните вводить текст, чтобы быстро найти свою категорию';
$_['filter_store'] = 'Магазин';
$_['filter_limit'] = 'Лимит';
$_['filter_limit_i'] = 'Ограничить количество элементов для экспорта. Начало: начать экспорт из этого элемента. - Ограничение: сколько элементов для экспорта.';
$_['filter_order_id'] = 'Идентификатор заказа';
$_['filter_order_status'] = 'Статус заказа';
$_['filter_order_status_i'] = 'Если ни один не выбран, он будет экспортировать все статусы заказа, кроме отсутствующих заказов';
$_['filter_customer'] = 'Клиент';
$_['filter_date_added'] = 'Дата добавлена';
$_['filter_date_modified'] = 'Дата изменена';
$_['filter_total'] = 'Всего';
$_['filter_limit_start'] = 'Начать';
$_['filter_limit_limit'] = 'Лимит';
$_['filter_start'] = 'Начать';
$_['filter_end'] = 'Конец';
$_['filter_min'] = 'Мин.';
$_['filter_max'] = 'Мак.';
$_['text_missing_orders'] = 'Недостающие заказы';

// Export options
$_['export_options'] = 'Опции';
$_['export_fields'] = 'Экспорт полей';
$_['export_fields_i'] = 'Выберите, какие поля вы хотите иметь в вашем файле экспорта';
$_['param_price_multiplier'] = 'Множитель цен';
$_['param_price_multiplier_i'] = 'Измените цену, отображаемую в файле экспорта, например, установите 1.12, чтобы добавить 12% к первоначальной цене.';
$_['param_image_path'] = 'Режим пути к изображению';
$_['param_image_path_i'] = 'Используйте полный URL-адрес, чтобы получить полный URL-адрес вашего изображения - относительный путь OpenCart следует использовать, только если вы будете использовать этот экспорт на том же веб-сайте';
$_['image_path_relative'] = 'Относительный путь OpenCart';
$_['image_path_absolute'] = 'Полный URL';

// Configuration
$_['text_tab_2'] = 'Опции';
$_['tab_option_1'] = 'Производительность';
$_['tab_option_2'] = 'Задание cron';
$_['tab_option_3'] = 'Основные опции';
$_['entry_default_import_label'] = 'Метка импорта по умолчанию';
$_['default_label_i'] = 'Установите здесь метку по умолчанию для сеанса импорта, это поможет вам легко фильтровать товары, импортированные в определенном сеансе в списке товаров.<br/><br/>Вы можете использовать эти теги : <code>[profile] [day] [month] [year]</code>';
$_['entry_batch_import'] = 'Номер партии импорта';
$_['entry_batch_export'] = 'Номер партии экспорта';
$_['entry_sleep'] = 'Задержка процесса';
$_['batch_import_i'] = '<h4>Номер партии</h4><p>Выберите количество элементов, обрабатываемых по каждому запросу, измените этот параметр, чтобы повысить производительность импорта/экспорта.<br/>Большое число может ускорить время процесса, но слишком большое число может привести к сбою в зависимости от ресурсов вашего сервера.</p><h4 style="margin-top:20px">Задержка процесса</h4><p>Импорт и экспорт используют очень большое количество ресурсов с сервера, на общем хосте или низкопрофильном сервере он может использовать почти все ресурсы, а затем ваш сайт может быть недоступен во время процесса.<br/>Параметр задержки позволяет Вам ожидать некоторые время перед каждой обработкой элемента, на этот раз освободит некоторый ресурс, чтобы позволить серверу работать некоторое время и обрабатывать другие запросы.<br/>Число в миллисекундах, что означает 1000 мс = 1 секунда, рекомендуемая настройка от 50 до 500.<br/>Имейте в виду, что большое значение этого параметра значительно увеличит время процесса импорта.</p>';

// Cron
$_['text_tab_cron_config'] = 'Конфигурация';
$_['text_tab_cron_import'] = 'Импорт';
$_['text_tab_cron_export'] = 'Экспорт';
$_['text_tab_cron_report'] = 'Отчет';
$_['text_cli_log_save'] = 'Сохраните файл лога';
$_['text_cli_clear_logs'] = 'Очистить логи';
$_['entry_cron_key'] = 'Безопасный ключ';
$_['entry_cron_key_i'] = 'Определите свой собственный безопасный ключ, он должен быть включен в команду cron';
$_['entry_cron_command'] = 'Команда Cron';
$_['text_cron_label'] = 'Установите метку импорта (будет использоваться метка профиля или метка по умолчанию, если она не определена):';
$_['text_cron_export_email'] = 'Отправить файл экспорта на электронную почту (это будет работать только для файлов не большого размера):';
$_['entry_cron_params'] = 'Дополнительные параметры';
$_['entry_cron_command_i'] = 'Это команда, которую вам нужно будет ввести в ваших заданиях cron (adapt [path_to_php] сделайте так, чтобы он соответствовал исполняемому файлу вашего сервера, может быть так /usr/bin/php, /usr/local/bin/php, /usr/local/cpanel/3rdparty/bin/php, ...)';
$_['entry_cron_params_i'] = 'Эти параметры являются необязательными, вы можете добавить параметр после основной команды, добавьте пробел между каждым параметром';
$_['cron_jobs_i'] = 'Вы можете автоматически запускать предопределенные профили с помощью заданий cron.<br/><br/>Все, что вам нужно сделать, это определить профиль, настроив все настройки на первой вкладке, а затем сохранить его на шаге 4. В конце команды укажите точное имя своего профиля.<br/>Будет создан отчет, чтобы вы могли принимать во внимание, если все прошло хорошо.<br/><br/>Обратите внимание, что задания cron работают только с файлами из URL, FTP или локального пути, а не с загруженными файлами для мгновенного использования.<br/><br/><b>Настройка заданий cron:</b><ol><li>Перейдите на вкладку импорта и выберите файл для работы с ним. Вы должны использовать файл в URL, FTP или локальном пути.</li><li>Настройте ваш канал (фид) с нужными вам параметрами, перейдите к шагу 4</li><li>На шаге 4 сохраните свой профиль</li><li>Зайдите в вашу cPanel или администрацию сервера, чтобы настроить работу cron</li><li>Скопируйте нужную вам команду ниже (не забудьте изменить имя профиля на ваше)</li><li>Все готово, ваш cron будет работать на основе ваших параметров, и вы можете проверить, все ли хорошо на вкладке отчета.</li></ol>';

$_['text_tab_about'] = 'О модуле';

// Warnings
$_['warning'] = 'Предупреждение';
$_['warning_category_id'] = 'Идентификатор категории не найден.';
$_['warning_discount_format'] = 'Неправильный формат скидки, формат должен быть: <b>&lt;customer_group_id&gt;:&lt;quantity&gt;:&lt;priority&gt;:&lt;price&gt;:&lt;date_start&gt;:&lt;date_end&gt;</b>, эта скидка не будет добавлена к товару';
$_['warning_remote_image_not_found'] = 'Удаленное изображение не найдено: ';
$_['warning_store_not_found'] = 'Магазин не найден: %s, убедитесь, что название магазина существует';

// Entry
$_['entry_status'] = 'Статус:';

// Message
$_['text_skip_insert']		= 'Действие нового элемента настроено на пропуск новых элементов';
$_['text_skip_update']		= 'Действие существующего элемента установлено, чтобы пропустить существующие элементы';
$_['text_skip_quick_update']		= 'Идентификатор не найден в вашей базе данных';
$_['text_skip_delete']		= 'Элемента для удаления не существует';
$_['text_insert_option']		= 'Добавить опцию';
$_['text_skip_option_not_found']		= 'Пропущено, потому что опция не найдена';
$_['text_skip_product_not_found']		= 'Пропущено, потому что соответствующий товар не найден';
$_['text_skip_option_no_product']		= 'Строка опций пропущена, поскольку соответствующий товар не найден';
$_['text_skip_option_no_option']		= 'Строка опции пропущена, потому что опция не найдена';

// Info
$_['info_title_default']		= 'Помощь';
$_['info_msg_default']	= 'Раздел помощи по этой теме не найден';
$_['info_soft_update_mode']	= 'Обновить режим сохранения: только отображаемые поля будут обновлены.';
$_['current_server_path']	= 'Это путь к вашему корневому каталогу opencart: ';
$_['text_filter_group']		= 'Группа фильтров';
$_['text_filter_name']		= 'Название фильтра';
$_['info_filter_title']		= 'Расширенный импорт фильтров';
$_['info_filter_xml']		= '
<p>Например, у вас есть массив, как:<br/>
<code style="white-space:pre">'.print_r(array('0'=> array('groupEn' => 'Filter group', 'nameEn' => 'Filter name')), true).'</code></p>
<p>В этом случае определите главный фильтр, соответствующий полю, содержащему массив значений, и в определенных параметрах ниже установите группу фильтров в <b>groupEn</b> and Filter name to <b>nameEn</b>.</p>';
$_['text_attribute_group']		= 'Группа атрибутов';
$_['text_attribute_name']		= 'Название атрибута';
$_['text_attribute_value']		= 'Значение атрибута';
$_['info_attributes_title']		= 'Импорт атрибутов';
$_['info_attributes_xml_title']		= 'Расширенные параметры для массива значений (импорт XML)';
$_['info_attributes']		= '
<p>Может быть отформатирован различными способами:
<ul><li>attribute_group_name:attribute_name:value</li>
<li>attribute_name:value</li>
<li>value (заголовок используется как имя атрибута)</li>
<li>&lt;ul&gt;&lt;li&gt;Group name: value&lt;/li&gt;&lt;/ul&gt;</li></ul></p>
<p>Группа и атрибут создаются автоматически, если они не существуют. Если атрибут не существует и группа не определена, он автоматически присваивается группе "по умолчанию".</p>';
$_['info_attributes_xml']		= '
<h4>Case 1</h4>
<p>Например, у вас есть массив, как:<br/>
<code style="white-space:pre">'.print_r(array('0'=> array('name' => 'Attribute name', 'value' => array('val' => 'Attribute value'))), true).'</code></p>
<p>В таком случае определите основной атрибут, соответствующий полю, содержащему массив значений, и в определенных параметрах ниже задайте название атрибута <b>name</b> и значение атрибута для <b>value/val</b>.</p>
<h4>Пример (case 2)</h4>
<p>XML, отформатированный как:<br/>
<code style="white-space:pre">&lt;attributes attribute_name_1="attribute_value_1" attribute_name_2="attribute_value_2"&gt;&lt;/attribute&gt;</code></p>
<p>Установить атрибут в <b>атрибуты</b> и помещенное ключевое слово [attributes] в <b>Название атрибута</b></p>
';
$_['info_options_title']		= 'Импорт опции';
$_['info_options_advanced_title']		= 'Дополнительные параметры для импорта опций';
$_['info_options_xml_title']		= 'Расширенные параметры для массива значений (импорт XML)';
$_['info_options']		= '
<p>Может быть отформатирован различными способами:
<ul>
<li>значение (название является названием заголовка или узла, тип автоматически устанавливается для выбора, если опции не существует)</li>
<li>name : value (тип автоматически устанавливается для выбора, если опции не существует)</li>
<li>type : name : value</li>
<li>type : name : value : price</li>
<li>type : name : value : price : qty</li>
<li>type : name : value : price : qty : subtract</li>
<li>type : name : value : price : qty : subtract : weight</li>
<li>type : name : value : price : qty : subtract : weight : required</li></ul></p>
<p>Опции и значения опций создаются автоматически, , если их не существует.</p>';
$_['info_options_advanced']		= '
<p><b>Отдельные поля для опций</b><br/>Если ваши параметры расположены в отдельных полях, оставьте поле основного параметра пустым и нажмите «Получить расширенные поля опций», чтобы иметь возможность устанавливать их отдельно.</p>
<p><b>Ваш файл импорта имеет параметры, заданные в виде новой строки</b><br/>Затем настройте поля расширенных параметров, как описано здесь, и перейдите на вкладку «Дополнительные функции», чтобы добавить функцию «Опции товара», чтобы указать способ идентификации строки параметра.';
$_['info_options_xml']		= '
<p>Например, у вас есть массив, как:<br/>
<code style="white-space:pre">'.print_r(array('0'=> array('name' => 'Option name', 'value' => array('val' => 'Option value'))), true).'</code></p>
<p>В этом случае определите основную опцию, чтобы он соответствовал полю, содержащему массив значений, а в определенных параметрах ниже установите название опции равным <b>name</b> и значение параметра <b>value/val</b>.<br/>
Если у вас есть несколько полей значений, и значения могут быть в одном или другом поле, вы можете определить, чтобы проверить оба поля, используя | для их разделения, например: field1|field2</p>';

// Error
$_['warning_incorrect_image_format'] = 'Неправильный формат изображения:';
$_['error_curl'] = 'Произошла ошибка при попытке загрузить файл, возможно, из-за того, что файл не существует или запрещен доступ к серверу.<br/>Детали: <b>%s</b>';
$_['error_extension'] = 'Тип файла не найден или не совместим для импорта: <b>%s</b>, разрешенные типы импорта: csv, xml, xls, xlsx, odt. Попытайтесь вызвать расширение файла.';
$_['error_file_not_found'] = 'Предупреждение: файл не может быть открыт, проверьте, корректен ли путь';
$_['error_xml_no_data'] = 'Предупреждение: данные не были найдены с данным узлом xml, убедитесь, что вы правильно установили имя узла, содержащего ваш набор данных';
$_['error_permission'] = 'Предупреждение: у вас нет разрешения на изменение этого модуля!';
$_['error_permission_demo'] = 'Демонстрационный режим, сохранение не допускается';
