<?php
// Text
$_['text_subject']          = '%s - Замовлення %s';
$_['text_greeting']         = 'Дякуємо за ваш інтерес до продуктів %s. Ваше замовлення надійшло і буде оброблено після підтвердження платежу.';
$_['text_link']             = 'Щоб переглянути ваше замовлення, натисніть на посилання нижче:';
$_['text_order_detail']     = 'Деталі замовлення';
$_['text_instruction']      = 'Інструкції';
$_['text_order_id']         = 'Ідентифікатор замовлення:';
$_['text_date_added']       = 'Дата замовлення:';
$_['text_order_status']     = 'Статус замовлення:';
$_['text_payment_method']   = 'Спосіб оплати:';
$_['text_shipping_method']  = 'Спосіб доставки:';
$_['text_email']            = 'Електронна пошта:';
$_['text_telephone']        = 'Телефон:';
$_['text_ip']               = 'IP-адреса:';
$_['text_payment_address']  = 'Адреса платежу';
$_['text_shipping_address'] = 'Адреса доставки';
$_['text_products']         = 'Продукція';
$_['text_product']          = 'Товар';
$_['text_model']            = 'Модель';
$_['text_quantity']         = 'Кількість';
$_['text_price']            = 'Ціна';
$_['text_order_total']      = 'Підсумки замовлень';
$_['text_total']            = 'Всього';
$_['text_download']         = 'Після підтвердження платежу ви можете натиснути посилання нижче, щоб отримати доступ до своїх завантажуваних продуктів:';
$_['text_comment']          = 'Коментарі до вашого замовлення:';
$_['text_footer']           = 'Будь-ласка, відповідайте на це повідомлення електронної пошти, якщо у вас виникли запитання.';