<?php
// Text
$_['text_subject']        = '%s - Дякуємо за реєстрацію';
$_['text_welcome']        = 'Ласкаво просимо і дякуємо за реєстрацію в %s!';
$_['text_login']          = 'Ваш обліковий запис створено, і ви можете увійти, використовуючи свою електронну адресу та пароль, відвідавши наш веб-сайт або за такою URL-адресою:';
$_['text_approval']       = 'Ваш обліковий запис має бути затверджено, перш ніж ви зможете ввійти. Після затвердження ви можете увійти, скориставшись електронною адресою та паролем, відвідавши наш веб-сайт або за такою URL-адресою:';
$_['text_service']        = 'Після входу ви зможете отримати доступ до інших служб, включаючи перегляд минулих замовлень, друк рахунків-фактур та редагування інформації свого облікового запису.';
$_['text_thanks']         = 'Дякуемо!,';
$_['text_new_customer']   = 'Новий клієнт';
$_['text_signup']         = 'Підписався новий клієнт:';
$_['text_customer_group'] = 'Група клієнтів:';
$_['text_firstname']      = 'Ім\'я:';
$_['text_lastname']       = 'Прізвище:';
$_['text_email']          = 'Електронна пошта:';
$_['text_telephone']      = 'Телефон:';