<?php
// Heading
$_['heading_title']    = 'Відстеження філій';

// Text
$_['text_account']     = 'Рахунок';
$_['text_description'] = 'Щоб переконатися, що ви заплатили за направлення, які ви надсилаєте нам, нам потрібно відстежити його, розмістивши код відстеження у URL-адресі, що посилається на нас. Ви можете використовувати наведені нижче інструменти для створення посилань на веб-сайт %s.';

// Entry
$_['entry_code']       = 'Ваш код відстеження';
$_['entry_generator']  = 'Генератор відстеження посилань';
$_['entry_link']       = 'Посилання для відстеження';

// Help
$_['help_generator']  = 'Введіть назву товару, на який ви хочете зв’язатись';