<?php
// Heading
$_['heading_title']       = 'Просмотренные товары';
// Text
$_['text_module']         = 'Модули';
$_['text_success']        = 'Успех: вы изменили модуль Просмотренные товары!';
$_['text_success_activation']        = 'Активировано: вы успешно активировали Просмотренные товары!';
$_['text_content_top']    = 'Содержимое вверху';
$_['text_content_bottom'] = 'Содержимое внизу';
$_['text_column_left']    = 'Колонка слева';
$_['text_column_right']   = 'Правая колонка';
$_['save_changes']				= 'Сохранить изменения';
$_['text_enable_or_disable']    = 'Включить или отключить модуль';
$_['text_enabled']              = 'Включено';
$_['text_disabled']             = 'Отключено';

// Entry
$_['entry_code']          = 'Статус модуля:';
$_['entry_highlightcolor']        = 'Цвет подсветки:<br /><span class="help">Это цвет, в котором выделено ключевое слово в результатах.<br/><br/><em>Примеры: красный, синий, #F7FF8C</em></span>';
// Entry
$_['entry_layout']        		= 'Макет:';
$_['entry_position']      		= 'Позиция:';
$_['entry_status']        		= 'Статус:';
$_['entry_sort_order']    		= 'Порядок сортировки:';
$_['entry_layout_options']      = 'Параметры макета:';
$_['entry_position_options']    = 'Параметры позиции:';
$_['entry_enable_disable']		= 'Статус входа в Facebook:<span class="help">Включение или отключение входа в Facebook для этого магазина</span>';
$_['entry_api']					= 'Идентификатор приложения Facebook';
$_['entry_secret']				= 'Секретный ключ приложения Facebook';
$_['entry_preview']				= 'Предварительный просмотр кнопки';
$_['entry_design']				= 'Дизайн кнопок';
$_['entry_no_design']			= 'Нет дизайна';
$_['entry_wrap_into_widget']	= 'Обертка кнопки в виджете';
$_['entry_yes']					= 'Да';
$_['entry_no']					= 'Нет';
$_['entry_wrapper_title']		= 'Название обертки';
$_['entry_button_name']			= 'Название кнопки';
$_['entry_use_oc_settings']		= 'Используйте настройки группы клиентов OpenCart<span class="help">Установите этот флажок, если хотите использовать настройки OpenCart. Если вы хотите назначить новых пользователей Facebook новой группе клиентов, снимите этот флажок.</span>';
$_['entry_assign_to_cg']		= 'Назначить в группу клиентов<span class="help">Группа клиентов, которая применяется при первом входе в систему.</span>';
$_['entry_new_user_details']	= 'Требуется новый пользователь<span class="help">Выберите поля, которые вы хотите, чтобы ваши новые пользователи заполняли при первом входе в систему через Facebook.</span>';
$_['entry_custom_css']			= 'Пользовательский CSS';
// Extra
$_['extra_company']				= 'Компания';
$_['extra_fax']					= 'Факс';
$_['extra_telephone']			= 'Телефон';
$_['extra_address']				= 'Адрес';
$_['extra_city']				= 'Город';
$_['extra_postcode']			= 'Почтовый индекс';
$_['extra_country']				= 'Страна';
$_['extra_region']				= 'Регион';
$_['extra_privacy']				= 'Соглашение о конфиденциальности';
$_['extra_newsletter']			= 'Новостная рассылка';
$_['extra_company_id']			= 'Идентификатор компании';
$_['extra_tax_id']				= 'Налоговый идентификатор';
// Error
$_['error_permission']    		= 'Предупреждение: у вас нет разрешения на изменение модуля входа в Facebook!';
// Custom CSS
$_['custom_css']				  = 'Пользовательский CSS:';
$_['custom_css_help'] 		     = 'Поместите ваши собственные стили здесь.';
$_['custom_css_placeholder']	  = 'Введите свой собственный CSS здесь...';
// Module depending
$_['wrap_widget']		 	 	 = 'Обертка в виджете:';
$_['wrap_widget_help'] 	   		= 'Если этот параметр включен, модуль будет отображаться в поле типа виджета. Эта функция зависит от темы, которую вы используете.';
$_['text_products']		 	   = 'Товары:';
$_['text_products_help'] 	      = 'Определите, сколько товаров будет отображаться.';
$_['text_image_dimensions']	   = 'Размер изображения товаров:';
$_['text_image_dimensions_help']  = 'Определите ширину и высоту изображения товара. В пикселях.';
$_['text_pixels']				 = 'пикс.';
$_['text_products_small']		 = 'товаров';
$_['text_panel_name'] 			 = 'Название панели:';
$_['text_panel_name_help']		= 'Выберите название панели. Многоязычная поддержка.';
$_['show_add_to_cart'] 			= 'Показать кнопку «Добавить в корзину»:';
$_['show_add_to_cart_help']	   = 'Включить / отключить отображение кнопки «Добавить в корзину» для отображаемых товаров';
$_['custom_positioning']	   = 'Пользовательское позиционирование';
$_['custom_positioning_below']	   = 'Ниже информация о товаре на странице товара';
$_['custom_positioning_no']	   = 'Нет пользовательского позиционирования';
$_['intelligent_sorting']	   = 'Интеллектуальная сортировка';
$_['intelligent_sorting_help']	   = ' <p>В статистике слева перечислены обычно просматриваемые вместе пары товаров, отсортированные по количеству просмотров.</p><p><i>Просмотренные товары</i> - модуль гарантирует, что элементы с самой высокой скоростью просмотра рекомендуются. Элементы, которые просматриваются время от времени, не отображаются случайным образом, что обеспечивает безошибочный и совершенный набор сопутствующих товаров.</p>';
$_['viewed_together']	  	 = 'Следующие товары обычно просматриваются в вашем магазине.';
$_['purchases']	 	  = 'Просмотры';

//Main twig
$_['text_module_statistics'] = 'Статистика модуля';
$_['text_toggle_dropdown'] = 'Переключение выпадающего списка';
$_['text_control_panel'] = 'Панель управления';
$_['text_usually_viewed'] = 'Просмотренные товары';
$_['text_support'] = 'Поддержка';

?>
