<?php 
// Heading
$_['heading_title'] 	    		= 'Стикеры';

// Text
$_['text_extension']   				= 'Расширения';
$_['text_success']     				= 'Настройки успешно изменены!';
$_['text_edit']        				= 'Настройки модуля';
$_['text_date_added']     			= 'Дата добавления';
$_['text_date_available']     		= 'Дата поступления';
$_['text_label_discount_percent']	= 'Текст с процентом';
$_['text_label_discount_price'] 	= 'Текст с ценой';
$_['text_label_percent'] 			= 'Процент по акции';
$_['text_label_text'] 				= 'Текст "Акция"';
$_['text_label_text_percent'] 		= 'Текст "Акция" и Процент по акции';
$_['text_left'] 					= 'Слева';
$_['text_right'] 					= 'Справа';
$_['text_star'] 					= 'Звёзда';
$_['text_rectangle'] 				= 'Прямоугольник';
$_['text_ribbon'] 					= 'Горизонтальная лента';
$_['text_diagonal'] 				= 'Диагональная лента';
$_['text_contact']        			= '<h2>Контакты:</h2><p>Skype: seregin-pro<br>Email: seregin-pro@ya.ru</p><h2>Техническая поддержка модулей:</h2><p>Понедельник - Пятница<br>09:00 - 17:00 (МСК)</p><h2>Формат сообщения:</h2><ol><li>Описание ошибки</li><li>Адрес вашего сайта (если есть)</li><li>Номер заказа и адрес торговой площадки</li><li>Номер версии модуля</li><li>Номер версии Opencart</li><li>Название шаблона</li></ol><p>Если ответ на сообщение не был получен в течении рабочего дня, то отправляйте повторно.</p>';
$_['text_warning'] 					= 'В зависимости от количества доступных полей скидок может создаваться несколько стикеров, поэтому для каждого число сортировки будет увеличиваться на единицу.';
$_['text_version']   				= 'Версия:';
$_['text_no_sticker']   			= 'Вы еще не добавили пользовательские стикеры.';

// Column
$_['column_name']            		= 'Название товара';
$_['column_model']           		= 'Модель';
$_['column_image']           		= 'Изображения';
$_['column_price']           		= 'Цена на сайте';
$_['column_quantity']        		= 'Количество';
$_['column_status']          		= 'Статус';
$_['column_sticker']          		= 'Стикеры';
$_['column_action']          		= 'Действие';

// Tab
$_['tab_setting']   				= 'Настройки';
$_['tab_product']     				= 'Товары';
$_['tab_contact']        			= 'Связаться с автором';
$_['tab_general']     				= 'Основные';
$_['tab_new']     					= 'Новый';
$_['tab_special']     				= 'Акция';
$_['tab_bestseller']				= 'Хит продаж';
$_['tab_stock']      				= 'Отсутствие на складе';
$_['tab_price']      				= 'Зависимые от цены';
$_['tab_custom']      				= 'Пользовательские';

// Entry
$_['entry_status'] 					= 'Статус';
$_['entry_offset_catalog_left_x'] 	= 'Смещение по горизонтали в левой колонке (Каталог)';
$_['entry_offset_catalog_right_x'] 	= 'Смещение по горизонтали в правой колонке (Каталог)';
$_['entry_offset_product_left_x'] 	= 'Смещение по горизонтали в левой колонке (Товар)';
$_['entry_offset_product_right_x'] 	= 'Смещение по горизонтали в правой колонке (Товар)';
$_['entry_offset_catalog_y'] 		= 'Смещение по вертикали (Каталог)';
$_['entry_offset_product_y'] 		= 'Смещение по вертикали (Товар)';
$_['entry_name_status'] 			= 'Показывать название';
$_['entry_date_new'] 				= 'Учитывать дату';
$_['entry_day'] 					= 'Считать товар новым (дней)';
$_['entry_sale'] 					= 'Считать товар хитом (количество продаж)';
$_['entry_label'] 					= 'Тип метки';
$_['entry_position'] 				= 'Отображение';
$_['entry_type'] 					= 'Тип стикера';
$_['entry_name'] 					= 'Название';
$_['entry_image'] 					= 'Изображение';
$_['entry_sort_order']       		= 'Порядок сортировки';
$_['entry_price']   				= 'Цена';
$_['entry_min']   					= 'Минимальная цена';
$_['entry_max']   					= 'Максимальная цена';
$_['entry_date']   					= 'Дата';
$_['entry_date_start']   			= 'Дата начала';
$_['entry_date_end']   				= 'Дата окончания';
$_['entry_model']            		= 'Модель';
$_['entry_quantity']         		= 'Количество';
$_['entry_discount_quantity'] 		= 'Показывать стикер для товара со скидкой при количестве 1';

// Button
$_['button_apply']   				= 'Применить';

// Error
$_['error_permission'] 				= 'У вас нет прав для управления данным модулем!';
$_['error_writable']     			= 'Необходимо создать файл %s и сделать его доступным для записи!';